[
  {
    "name": "FOR:УМ",
    "task_description": "Прими участие в хакатоне FOR:УМ Зданий и разработай инновационное решение для цифровизации умных зданий! FOR:УМ Зданий — хакатон для тех, кто создаёт технологии будущего в сфере «умных зданий»! Участники разрабатывают цифровые сервисы для комфорта, безопасности и энергоэффективности многоквартирных домов. З\nадача хакатона: Разработать инновационный цифровой сервис на базе платформы Ujin OS , который поможет: - Улучшить управление «умными зданиями»\n- Оптимизировать энергопотребление\n- Повысить безопасность и комфорт жильцов Тебя ждёт: - Разработка продукта в одном из треков хакатона\n- Работа в команде и опыт проектной разработки\n- Консультации с экспертами и нетворкинг\n- Шанс получить ценные призы и внимание потенциальных заказчиков Кто может поучаствовать? - Разработчики\n- Программисты\n- Аналитики данных\n- Дизайнеры\n- Менеджеры проектов, интересующиеся цифровизацией недвижимости Условия участия: - Команда от 3 человек\n- Возраст участников: 18–35 лет\n- Навыки программирования (любой язык), базовый frontend\n- Плюсом будет знание Docker, PHP, Python, SDK Призы для победителей! По итогам соревнования эксперты выберут лучшие проекты, а команды получат ценные награды от организаторов. Т\nаймлайн хакатона FOR:УМ Зданий: до 14 мая Регистрация 22–23 мая Дата проведения 23 мая Подведение итогов и награждение Дата проведения: 22-23 мая Место проведения: г.Пермь, Ул. С\nоветская 1б, Коворкинг «Точка кипения» Регистрация до 14 мая: Зарегистрироваться",
    "start_of_registration": null,
    "end_of_registration": "14 мая 2025",
    "start_of_hack": "22 мая 2025",
    "end_of_hack": "23 мая 2025",
    "amount_money": null,
    "type": "offline",
    "url": "https://www.xn--80aa3anexr8c.xn--p1acf/tpost/yd4yk40ta1-forum"
  },
  {
    "name": "Avito ML cup 2025",
    "task_description": "Знаете где ваш код может стоить 250 000 рублей? На ML-соревновании от Avito Tech! Здесь две секции — можете заняться алгоритмами настройки рекомендаций или поиска дублей. И\nли поучаствуйте и там, и там, чтобы увеличить шансы на победу вдвое! Тебя ждет: - Разработка ML-модели, способной рекомендовать товары на основе истории пользователя и метаинформации\n- Возможность прокачать свои навыки в анализе данных и построении рекомендательных систем\n- Консультации и нетворкинг с экспертами AvitoTech\n- Два направления, где у вас будет возможность проявить себя\n- Шанс разделить призовой фонд в размере 600 000 рублей Секция №1 \"Персональные рекомендации\" — хакатон для тех, кто хочет создать алгоритм персонализированных рекомендаций! Организаторы запускают соревнование, где участники разработают модель, которая предсказывает наиболее актуальные товары для пользователей Avito. Т\nрек соревнования: Персональные рекомендации Разработать алгоритм, который предскажет наиболее релевантные товары для пользователей Avito. М\nетрика соревнования — Recall@40 Формат решения — список рекомендованных товаров для пользователей Секция №2 \"Поиск дублей\" — хакатон для тех, кто решает сложные задачи машинного обучения! Организаторы запускают соревнование, где участники разработают алгоритм для поиска дубликатов объявлений на платформе Avito. З\nадача хакатона: Разработать алгоритм, который сможет выявлять дубликаты среди миллионов объявлений, анализируя текстовые описания, изображения и другие атрибуты. Т\nрек соревнования: Поиск дубликатов объявлений Разработать алгоритм, который на основе текстовой информации, изображений и других атрибутов выявляет дубликаты в массиве объявлений. Р\nешения должны быть представлены в формате CSV с колонками: (base_id, cand_id, probability), где probability — вероятность того, что объявления являются дубликатами. М\nетрика соревнования — Mean Average Precision. К\nто может принять участие в секциях? - ML-специалисты\n- Data Scientists\n- Аналитики данных\n- Разработчики с опытом работы в машинном обучении Условия участия: - Участвовать можно одному или в составе команды\n- Лимит команды — 4 человека Таймлайн для Avito ML cup 2025: 31 марта 2025 – Старт подачи решений 27 мая 2025, 23:59 (МСК) – Окончание приема заявок на участие 28 мая 2025, 12:00 (МСК) – Дедлайн выбора финальных решений Призовой фонд в каждой секции: 600 000 рублей 1 место — 250 000 рублей 2 место — 200 000 рублей 3 место — 150 000 рублей Дата проведения: 31 марта-28 мая Формат: онлайн Регистрация до 12 апреля: Персональные рекомендации Поиск дублей",
    "start_of_registration": null,
    "end_of_registration": "12 апреля 2025",
    "start_of_hack": "31 марта 2025",
    "end_of_hack": null,
    "amount_money": 600000.0,
    "type": "online",
    "url": "https://www.xn--80aa3anexr8c.xn--p1acf/tpost/m513a8z151-avito-ml-cup-2025"
  },
  {
    "name": "Хакатон Белые хакеры",
    "task_description": "Участники Хакатона со всей России получат возможность пройти ознакомительно-теоретический курс в сфере кибербезопасности и получить полезные навыки для начала будущей карьеры. К\nучастию приглашаются: Учащиеся 5-11 классов и их руководители Республики Саха (Якутия). О\nбласти обеспечения кибербезопасности: 1. М\nессенджеры - Узнайте, какие киберугрозы распространены в Мессенджерах\n- Попробуйте себя в роли «белого» хакера и проведите анализ системы информационной безопасности в Мессенджере\n- Составьте рекомендации по обеспечению кибербезопасности в Мессенджере 2. С\nистемы беспроводной связи - Узнайте, какие киберугрозы опасны для Систем беспроводной связи\n- Попробуйте себя в роли «белого» хакера и найдите слабые места в Системе беспроводной связи\n- Составьте рекомендации по обеспечению кибербезопасности Систем беспроводной связи 3. Э\nлектронные устройства - Узнайте, какие киберугрозы актуальны для Электронных устройств\n- Попробуйте себя в роли «белого» хакера и проникните в систему безопасности Электронных устройств\n- Предложите варианты улучшения системы информационной безопасности Электронных устройств Отрасли хакерских атак: 1. Б\nанковская сфера Взлом банковских систем грозит кражей денег со счетов клиентов или получение доступа к банковским системам для перевода средств. Н\nекоторые атаки направлены на сбор конфиденциальной информации, которую затем могут продать на черном рынке. И\nногда черные хакерские группировки действуют под влиянием политических целей, стремясь нанести ущерб финансовой системе страны или организации. В\nредких случаях черные хакеры могут атаковать банк ради дестабилизации экономики или создания паники среди населения. 2. Ц\nентр исследований и разработок Взлом Центров исследований и разработок позволяет злоумышленникам украсть интеллектуальную собственность, такую как патенты, технологии и ноу-хау, может дать конкурентам значительное преимущество на рынке. П\nолученная информация может быть продана на черном рынке другим компаниям или государствам. Ч\nерные хакеры могут саботировать разработки, которые они считают вредными или этически неприемлемыми. П\nравительства могут использовать черных хакеров для получения доступа к передовым технологиям и стратегической информации 3. С\nлужба доставки Доступ к базе данных пользователей позволяет получить информацию о платежах, адресах и контактах, которая может использоваться для мошенничества. В\nзлом системы отслеживания отправлений дает возможность изменить маршруты доставки и перенаправить посылки на другие адреса. Ч\nерные хакеры могут изменять данные о стоимости товаров или способе оплаты, чтобы незаконно присвоить деньги. П\nолучив контроль над системой, черные хакеры могут требовать выкуп за восстановление работы сервиса или неразглашение украденных данных. 4. П\nромышленность Нарушение работы производственных линий может привести к значительным убыткам для компаний, что иногда используется для шантажа и вымогательства. В\nзлом промышленных объектов может ослабить экономику другой страны и международные отношения. В\nредоносные программы могут использоваться для саботажа производств, что приводит к экологическим катастрофам. М\nанипуляция сотрудниками через фишинг или социальную инженерию для получения доступа к критичным системам управления производством. Э\nтапы: 1 февраля - 30 марта Знакомство с белыми хакерами Вы получите разборы известных хакеров из фильмов и сериалов, факты о хакерах, интервью, практические задания. Н\nаконец, вы узнаете, кто такие белые хакеры, где они работают, какие задачи они выполняют и какие ценности за этим стоят. М\nожет быть, именно ты - белый хакер? 1 апреля - 1 мая Онлайн-университет кибербезопасности Вы получите доступ к образовательному курсу, где познакомитесь с основными областями обеспечения кибербезопасности: - Мессенджеры\n- Системы беспроводной связи\n- Электронные устройства В каждой области вы пройдете путь белого хакера: 1. А\nудит архитектуры информационной системы;\n2. П\nроверка человеческого фактора;\n3. А\nнализ уязвимостей;\n4. Р\nекомендации по реагированию и устранению угроз Для завершения Онлайн-университета вам предстоит выполнить Выпускную работу: спроектировать белую хакерскую атаку. 26 мая - 1 июня Онлайн-интенсив для подготовки к Хакатону - По итогам оценки выпускных работ, 60 самых талантливых хакеров пройдут в модуль подготовки к Хакатону в формате онлайн-интенсива\n- В течение недели 60 финалистов будут каждый день получать задание на развитие навыков программированияВ течение недели 60 финалистов будут каждый день получать задание на развитие навыков программирования\n- На решение задания будет дано 6 часов, после чего вас ждет код-ревью с экспертом 27 - 29 июня Финал. ВНа решение задания будет дано 6 часов, после чего вас ждет код-ревью с экспертом 27 - 29 июня Финал. В\nсероссийский карьерный хакатон «Белые хакеры» 60 юных хакеров разделятся на кроссфункциональные команды и устроят стресс-тест по основным отраслям хакерских атак: - Банковская сфера\n- Центр исследований и разработокЦентр исследований и разработок\n- Служба доставкиСлужба доставки\n- Промышленность. ППромышленность. П\nомимо победы, лучшие из лучших получат приглашение на стажировку. Ф\nормат: онлайн/офлайн в г. С\nанкт-Петербург Регистрация до 1 мая: Зарегистрироваться",
    "start_of_registration": null,
    "end_of_registration": "1 мая 2025",
    "start_of_hack": null,
    "end_of_hack": null,
    "amount_money": null,
    "type": "online",
    "url": "https://www.xn--80aa3anexr8c.xn--p1acf/tpost/imklbzv241-belie-hakeri"
  },
  {
    "name": "Город героев",
    "task_description": "Для энергичных и амбициозных! Самое масштабное ИТ-событие Омска для школьников и студентов младших курсов возвращается. Хакатон пройдёт с 2 по 4 мая 2025 года и станет отличной возможностью для молодых и энергичных людей погрузиться в цифровой мир и получить незабываемый опыт. Цель мероприятия: Познакомить участников с реальными задачами ИТ-индустрии, развить навыки командной работы, hard- и softskills, а также показать, что даже без навыков программирования можно создать крутой проект с помощью инструментов Low- и No-Code. Участников ждёт: - Решение кейсов от ведущих ИТ-компаний Омской области\n- Выступления действующих разработчиков, директоров и сверстников\n- Возможность представить свой проект экспертам индустрии\n- Крутая атмосфера, удобные рабочие места, кофе-брейки, обеды и Wi-Fi\n- Полезные знакомства и реальный опыт разработки Важно! - Участие командное (рекомендуется 3–5 человек)\n- Можно участвовать без навыков программирования\n- Нужно взять с собой ноутбук\n- Главное — желание учиться, творить и веселиться! Принять участие в соревновании могут: - Школьники 7–11 классов\n- Студенты колледжей 1–2 курсов Даты проведения: 12-4 мая Место проведения: г. Омск, ул. Маршала Жукова, д. 21, \"Точка кипения - Омск\" Регистрация до 1 мая: Зарегистрироваться",
    "start_of_registration": null,
    "end_of_registration": "1 мая 2025",
    "start_of_hack": "2 мая 2025",
    "end_of_hack": "4 мая 2025",
    "amount_money": null,
    "type": "offline",
    "url": "https://www.xn--80aa3anexr8c.xn--p1acf/tpost/1fhvmnaa81-gorod-geroev"
  }
]